<script setup>
import { ref } from 'vue'
import Technologies from '../components/Technologies.vue'

const technologies = ref({
  roles: [ 'concept', 'architects', 'product design', 'frontend', 'backend', 'db', 'lead' ],
  design: [ 'figma' ],
  frontend: [ 'vue2', 'webpack', 'less', 'electron' ],
  backend: [ 'node', 'express' ],
  db: [ 'mongodb', 'mongoose' ],
  infrastructure: [ 'git', 'docker', 'bitbucket', 'clickup' ]
})

let activeTab = ref(0)
function setTab (value) {
  activeTab.value = value
}
</script>

<template>
  <div class="page-container">
    <h1>Hemagon</h1>
    <div class="project-link">
      <a
        href="https://hemagon.com"
        target="_blank"
      >
        hemagon.com→
      </a>
    </div>

    <div class="tabs-menu">
      <button
        :class="{ active: activeTab === 0 }"
        @click="setTab(0)"
      >
        Overview
      </button>
      <button
        :class="{ active: activeTab === 1 }"
        @click="setTab(1)"
      >
        Brief preview
      </button>
      <button
        :class="{ active: activeTab === 2 }"
        @click="setTab(2)"
      >
        Full story
      </button>
      <button
        :class="{ active: activeTab === 3 }"
        @click="setTab(3)"
      >
        Tech stuff
      </button>
    </div>
    <div class="tabs">
      <div
        v-if="activeTab === 0"
        class="tab"
      >
        <img src="../assets/projects/hemagon/intro_2.png" alt="Nicolay Apraksin / Hemagon / Intro">

        <div class="text accent">
          Хемагон это спортивная платформа, ориентированная на HEMA фехтование.
          <br>
          Основная задача платформы — создать единую инфраструктуру для организаторов и участников, а также дать возможность последним отслеживать прогресс своих навыков.
          <br>
          Я разработал ее в одиночку.
          За 4 года программа выросла из сайд проекта в полновесную систему, на которой проходят все туриры на территории России.
        </div>

        <Technologies :technologies="technologies" />
      </div>
      <div
        v-if="activeTab === 1"
        class="tab"
      >
        <img src="../assets/projects/hemagon/0.png" alt="Nicolay Apraksin / Hemagon / Index page">
        <div class="text">
          Хемагон состоит из нескольких взаимосвязанных уровей, решающих задачи разных целевых групп комьюнити.
          <br>
          Первый уровень позволяет огранизаторам мероприятий — турниров — <b>описывать регалмент</b>.
          В фехтовании множество видов оружия, для каждого из них правила проведения разные.
          Турнир может состоять из десятка номинаций. Хемагон позволяет собрать схему точно описывающую любой такое мероприятие.
          <br>
          Второй уровень — проведение самого турнира. Важнейшим элементом проведения боев является подсчет очков.
          На их основе идет <b>составление рейтинга</b> бойцов, отбор участников переходящих от этапа к этапу и в итоге определяются победители турнира.
          Хемагон огранизует этот процесс.
          Операторы фехтовальных площадок учитывают очки, а организатор через свой интерфейс управляет всем ходом мероприятия.
          <br>
          Третий уровень — <b>демонстрация турнира</b>.
          Все данные с площадок в реальном времени отображаются на сайте в турнирных таблицах.
          Это позволяет участвующим бойцам и зрителям следить за турниром в реал тайме.
          После турнира бойцы могут видеть показатели своих побед, набранных очков и статистику по мероприятию
          <br>
          Четвертый уровень — <b>общая статистика</b> за всё время.
          Результаты каждого мероприятия влияют на позиции бойцов в общем рейтинге.
          На основе этих данных составляются персональные прогрессии бойцов, учет их достяжений и аналитика.
          <br>
          Таким образом Хемагон является платформой полного цикла для фехтовальной индустрии.
        </div>
        <img src="../assets/projects/hemagon/11.png" alt="Nicolay Apraksin / Hemagon / Stream caption">
      </div>
      <div
        v-if="activeTab === 2"
        class="tab"
      >
        <div class="text">
          В 2008 я занялся историческим фехтоваинием, к 2010 добрался до первых турниров.
          В это время турниры провдились "на бумаге" и я понял, что так не должно быть, все должно быть в онлайне.
          Но опыта ещё было мало.
          <br>
          В 2017 я перешел в другой клуб.
          И на носу был проведение этим клубом крупнейшего в россии турнира — FechtTerra.
          <br>
          Я понял, что моё время пришло, я уже стал довольно опытным разработчиком, и сказал, что к труниру сделаю свою систему.

          <h2>Хемагон 1.0</h2>
          Времени было немного, поэтому нужно было с одной стороны быстрое, а с другой максимально надежное решение.
          <b>Я написал на electron + vue десктопное приложение</b>, для учета очков и систему составления рейтинга для управления турниром.
          <br>
          Турнир прошел на моей системе.
          <b>Система позволила сократить время турнира, тк все вычисления были моментальными</b>.
          Организаторы были в восторге.
          <br>
          После этого стало понятно, что к следующему году нужно сделать полноценную версию этой программы — c нормальным бекендом, с нормальным обменом данными и тд.

          <h2>Хемагон 2.0</h2>
          Проблема первого решения была в офлайновости - все данные были только у организаторов, бойцы не имели к ним доступа.
          <br>
          <b>Очевидым шагом было сделать единую платформу</b>,
          данные на которую попападают в реальном времени с площадок,
          их могут видеть бойцы и результаты прошедших турниров доступны к просмотру.
          <br>
          И я сел за разработку...

          <h2>Хемагон сейчас</h2>
          Фехтовальные турниры представляют из себя набор последовательных этапов.
          <br>
          Самая популярная схема — групповой этап, сильнейший из которого переходят в этап с боями на выбывания до определения победителя.
        </div>
        <img src="../assets/projects/hemagon/2a.png" alt="Nicolay Apraksin / Hemagon / Tournament">
        <div class="text">
          На основе результатов туринров формируется общий рейтинг по типам оружия.
          <b>Рейтинг считается по системе Glicko2 и автоматически обновляется</b> после завершения каждого турнира.
        </div>
        <img src="../assets/projects/hemagon/4.png" alt="Nicolay Apraksin / Hemagon / Rating">
        <div class="text">
          О каждом бойце можно узнать многое  — его достяжения, на каких видах оружия выступает, как часто побеждает и много другое.
        </div>
        <img src="../assets/projects/hemagon/6a.png" alt="Nicolay Apraksin / Hemagon / Fighter profile">

        <div class="text">
          Наличие <b>больших данных</b> о фехтовальщиках позволило строить интересные графики.
          <br>
          Ниже представлен <b>социальный граф</b>. Он показывает близость бойцов друг к дурга.
        </div>
        <img src="../assets/projects/hemagon/6b.png" alt="Nicolay Apraksin / Hemagon / Fighter profile">

        <div class="text">
          <h2>Интерфейс огранизатора</h2>
          Главная работа огранизатора — <b>создание и наполнение турниров</b>.
          Каждая номинация турнира имеет множество настроек, влияющих на поведение системы.
          <br>
          Главная — <b>rating mode</b> — <b>способ подсчета рейтинга</b>. Где то важнейшим является процент побед, где то вместо этого считаются матчпоинты.
          <br>
          Учитываются ли обоюдные попадания, предупреждения и аппеляции?
        </div>
        <img src="../assets/projects/hemagon/7a.png" alt="Nicolay Apraksin / Hemagon / Nomination creation">
        <div class="text">
          После создания номинации администратор <b>формирует очередность этапов</b>.
          <br>
          Чаще всего первый этап — пулы. Организатор может составить пулы <b>автоматически исходя из рейтинга</b>,
          но чаще всего это делается вручную исходя из экспертной оценки.
          <br>
          Для удобства процесса, это решено через драгэндроп — перетягивай нужных бойцов в нужные пулы.
        </div>
        <img src="../assets/projects/hemagon/7.png" alt="Nicolay Apraksin / Hemagon / Pool creation">
        <div class="text">
          <h2>Проведение турнира</h2>
          Оператор площадки запускает бои, а во время боя слушает решения судьи и <b>заносит их в систему</b>.
          <br>
          Сделан <b>упор на юзабилити интерфейса оператора</b> - все действия на клавиатуре, не надо отрываться на мышь и искать кнопки.
          <br>
          Для дополнительного удобства оператор может посмотреть <b>историю внесения очков</b>.
        </div>
        <img src="../assets/projects/hemagon/9.png" alt="Nicolay Apraksin / Hemagon / Fight interface">
        <div class="text">
          Очки показываются на мониторе обращенному к бойцам.
          <br>
          Здесь используются максимально <b>контрастные цвета</b>, очки выводится <b>болшим кеглем</b>, ведь бойцы смотрят на монитор издалека.
          <br>
          Для ожидающих своего боя, <b>выводится подсказка, кто будет драться следующим</b>.
        </div>
        <img src="../assets/projects/hemagon/10.png" alt="Nicolay Apraksin / Hemagon / Fight demo">
        <div class="text">
          Также в системе <b>реализован титр для стрима</b>.
          <br>
          <b>Инфорамция в риалтайме постуает на сервер</b> и с каждой площадки можно выводить плашку с информацией о бойцах и счете.
        </div>
        <img src="../assets/projects/hemagon/11.png" alt="Nicolay Apraksin / Hemagon / Stream caption">
      </div>
      <div
        v-if="activeTab === 3"
        class="tab"
      >
        <div class="text">
          Технически вся система представляет из себя 3 уровня -
          <ol>
            <li>
              <b>Бекенд</b>, где обрабатываются и хранятся все данные.
              Он реализован на <b>nodejs + expressjs</b> с базой данных <b>mongodb + mongoose</b>.
            </li>
            <li>
              <b>Пользовательский, огранизаторский и административный фронтенд</b> написан на <b>vue2</b> со сборкой через <b>webpack</b>.
              Весь пользовательский интерфейс локализован на двух языках — ру и ен.
              Пользовательсякая часть полностью адаптивна и заточена на просмотр с мобильных устройств, тк 70% пользователей заходят с них.
            </li>
            <li>
              <b>Приложение</b> для операторов площадок на <b>electron + vue2</b>.
            </li>
          </ol>
        </div>
        <img src="../assets/projects/hemagon/tech_1.svg" alt="Nicolay Apraksin / Hemagon / Tech structure">
        <div class="text">
          В системе есть 5 категорий пользователей -
          <ol>
            <li>
              <b>Пользователь-гость</b>. Он может смотреть информацию о турнирах, следить за ходом проведения турнира, смотреть статистику.
            </li>
            <li>
              <b>Авторизованный пользователь</b>. Он может управлять своим профилем, а также подавать заявки на регистрацию на турнирах.
            </li>
            <li>
              <b>Организатор турнира</b>. Он имеет право создавать турниры, и управлять их проведением.
            </li>
            <li>
              <b>Оператор фехтовальной площадки</b> — через десктопное приложение имеет право записывать резульаты боёв.
              Кроме того огранизатор имеет право создавать пользователей и фехтовальные организации — клубы.
            </li>
            <li>
              <b>Администратор</b>. Имеет полный доступ к системе с возможностью редактирования всех данных — турниров, пользователей, клубов, типов оружия.
              Обладает расширенными интерфейсами редактирования пользователей, — массвой обработкой, заменами, объединениями, механизмам рассчета статистики и аналитики.
            </li>
          </ol>
        </div>
        <img src="../assets/projects/hemagon/tech_2.svg" alt="Nicolay Apraksin / Hemagon / Logic structure">
        <div class="text">
          Особой сложностью в проектировании этой системы было <b>правильно декомпозировать предметную область</b>.
          <br>
          Правила фехтовальных турниров сильно разнятся и нужно было разработать такую структуру данных, которая бы позволяла подстроится под все эти изменения.
          <br>
          Посредством анализа была разработана следующая <b>модульная система</b>:
          <br>
          Турнир > Номинация > Этап > Пул > Бой.
          <br>
          Номинация наполняется любыми этапами в любом порядке, они сткуются входными-выходными параметрами — количеством бойцов и правилами отбора.
          Сущность Пула позволяет с легкостю описать как Групповой этап так и Швейраскую систему,
          а при специальнйо системе индексов отлично подошла и для Олимпийской системы.
        </div>
      </div>
    </div>
  </div>
</template>

<style></style>
