<script setup>
import { ref } from 'vue'
import Technologies from '../components/Technologies.vue'

const technologies = ref({
  roles: [ 'architects', 'product design', 'frontend', 'backend', 'db', 'lead' ],
  design: [ 'figma' ],
  frontend: [ 'vue3', 'vite', 'less' ],
  backend: [ 'node', 'express' ],
  db: [ 'mongodb', 'mongoose' ],
  infrastructure: [ 'git', 'docker', 'bitbucket', 'clickup' ]
})

let activeTab = ref(0)
function setTab (value) {
  activeTab.value = value
}
</script>

<template>
  <div class="page-container">
    <h1>Kvetun</h1>

    <div class="tabs-menu">
      <button
        :class="{ active: activeTab === 0 }"
        @click="setTab(0)"
      >
        Overview
      </button>
      <button
        :class="{ active: activeTab === 1 }"
        @click="setTab(1)"
      >
        Full story
      </button>
    </div>
    <div class="tabs">
      <div
        v-if=" activeTab === 0"
        class="tab"
      >
        <div class="text accent">
          Кастомная Production and business management system for fencing equipment factory.
          Продукт разработан под воркфлоу двух отделов компании:
          <ul>
            <li>маркетингое - занесение новых заказов, описание требований и спецификаций, задачи;</li>
            <li>производственное - план изготовления, ведение заказа в процессе изготовления, производственные лимиты, рассчет материалов.</li>
          </ul>
          Система позволила оптимизировать работу маркетингово отдела, сократить время от появления заказа до введения его в производства,
          наладить взаимодействие между отделами через систему задач, дала статистическую информацию для долгосрочного планирования.
          <br>
          Разработка начиналась мной в одиночку, но с развитием я привлек ещё одного фуллстак разработчика для увеличения скорости разработки.
        </div>

        <Technologies :technologies="technologies" />
      </div>
      <div
        v-if=" activeTab === 1"
        class="tab"
      >
        <div class="text">
          Все интерфейсы выполнены в предельном минимализме: сотрудники рабаотают с ней на протяжении всего дня и цель была создать
          интерфейс с максимальным упором на юзабилити с минимальным количеством отвлекающих элементов.
          Вся важная информация на переднем плане, все интерактивные элементы акцентированы исходя из их важности.

          <h2>Заказы</h2>
          Центральным компонентом системы является заказ, как основная единица бизнеса.
          Для главы отдела продаж важно видеть за какие периоды сколько заказов совершено, на каких этапах произодства они какая ожидаемая выручка.
        </div>
        <img src="../assets/projects/kvetun/0.png" alt="Nicolay Apraksin / Kvetun /  Orders table">

        <div class="text">
          Сам заказ - довольно комплексная единица. Бизнесс работает по всему миру, поэтому рассчет идет в разных валютах.
          Заказ наполняется продуктами, продукты кастомизируются из модулей, к ним крепятся описания и требования к характеристикам.
          Исходя из объема и сложности заказа определяются производственные рамки и условия доставки.
          По каждому заказу генерируются инвойсы в соответствии с необходимостями почтывых служб.
          А для избежания производственных ошибок все изменения заказов логгируются с возможностью просмотра изменений и возврата к прежним версиям.
        </div>
        <img src="../assets/projects/kvetun/1.png" alt="Nicolay Apraksin / Kvetun / Order detail">

        <div class="text">
          Для удобства работы с почтовыми службами сделана система коробок. Администратор может указать в каком количестве коробок какого веса будет отправляться заказ.
          Каждая коробка снабжается персональной документацией для прохождения таможен.
        </div>
        <img src="../assets/projects/kvetun/2.png" alt="Nicolay Apraksin / Kvetun / Boxes system">

        <div class="text">
          Для повышения доступности клиентов система снабжена платежным сервисом. Менеджер сформировав заказ по требованиям клинта, может сразу выслать тому ссылку на оплату.
        </div>
        <img src="../assets/projects/kvetun/3.png" alt="Nicolay Apraksin / Kvetun / Payment page">

        <div class="text">
          <h2>Продукты</h2>
          Кветунь занимается изготовлением и реализацией широково спектра фехтовального инвентаря.
          Различные фехтовальные снаряды: сабли, рапиры, мечи, кинжалы и тд.
          Защитное снаряжение: перчатки, щитки, маски и куртки.
          Экипировка: сумки, чехлы.
          И это лишь малая часть.
          <br>
          Все было бы хорошо, но каждое из этих изделий поддается кастомизации по требованию заказчиков. Где то требуется изменить размеры,
          где то выбор типа определенного элемента, например обмотки рукояти.
          Для решения задачи по учету всего этого многообразия элементов была сделана система по кастомизации продукции.
          <br>
          Каждый кастомизируемый элемент заносится в базу с указанием возможных вариаций.
        </div>
        <img src="../assets/projects/kvetun/4.png" alt="Nicolay Apraksin / Kvetun / Product module creation">
        <div class="text">
          У каждого продукта выбирается список изменяемых модулей. На изображении ниже указаны модули для сабли.
        </div>
        <img src="../assets/projects/kvetun/5.png" alt="Nicolay Apraksin / Kvetun / Product modules set">
        <div class="text">
          И в дальнейшем менеджер при формировании заказа может на лету указывать требования клиента к кастомизации изделий.
        </div>
        <img src="../assets/projects/kvetun/6.png" alt="Nicolay Apraksin / Kvetun / Product in order customisation">

        <div class="text">
          <h2>Сводная таблица для производства</h2>
          Данный интерфейс показывает производственный план на месяц.
          Здесь собраны и организованы по типам все изделения которые необходимо изготовить, подсчитан расходы материалов.
          По этим данным формируется PDF документ с расстановкой задач производственным отделам.
        </div>
        <img src="../assets/projects/kvetun/8.png" alt="Nicolay Apraksin / Kvetun / Summary">

        <div class="text">
          <h2>Система задач</h2>
          Взаимодействие внутри системы между сотрудниками происходит через систему задач.
          Она соответсвует по функционалу общепритяным таск трекерам, но заточена под контректную область деятельности.
          Как пример - задача может касаться заказа, нескольких заказов или же конкретных продуктов в заказе.
          Таким образом из интерефейса закза менеджер может быстро пометить проблемные продукты,
          задачи сразу будут выставлены соотвествующему производственному отделу и тот примится их решать.
        </div>
        <img src="../assets/projects/kvetun/9.png" alt="Nicolay Apraksin / Kvetun / Task labels">
        <img src="../assets/projects/kvetun/10.png" alt="Nicolay Apraksin / Kvetun / Task detail">
      </div>
    </div>
  </div>
</template>

<style></style>
