<script setup>
import { ref } from 'vue'
import Technologies from '../components/Technologies.vue'

const technologies = ref({
  roles: [ 'architects', 'product design', 'frontend', 'backend', 'db', 'lead' ],
  design: [ 'figma' ],
  frontend: [ 'vue3', 'vite', 'less' ],
  backend: [ 'node', 'express' ],
  db: [ 'mongodb', 'mongoose' ],
  infrastructure: [ 'git', 'docker', 'bitbucket', 'clickup' ]
})

let activeTab = ref(0)
function setTab (value) {
  activeTab.value = value
}
</script>

<template>
  <div class="page-container">
    <h1>Kvetun</h1>

    <div class="tabs-menu">
      <button
        :class="{ active: activeTab === 0 }"
        @click="setTab(0)"
      >
        Overview
      </button>
      <button
        :class="{ active: activeTab === 1 }"
        @click="setTab(1)"
      >
        Full story
      </button>
    </div>
    <div class="tabs">
      <div
        v-if=" activeTab === 0"
        class="tab"
      >
        <div class="text accent">
          Custom production and business management system for fencing equipment factory.
          <br>
          Продукт разработан под воркфлоу двух отделов компании:
          <ul>
            <li>маркетингое — занесение новых заказов, описание требований и спецификаций, задачи;</li>
            <li>производственное — план изготовления, ведение заказа в процессе изготовления, производственные лимиты, рассчет материалов.</li>
          </ul>
          Система позволила <b>оптимизировать работу маркетингово отдела</b>, сократить время от появления заказа до введения его в производства,
          наладить взаимодействие между отделамичерез систему задач, дала статистическую информацию для долгосрочного планирования.
          <br>
          Разработка начиналась мной в одиночку, но с развитием я перешел на позицию <b>проджект менеджера</b>, делегировав всю работу нанятым разработчикам.
        </div>

        <Technologies :technologies="technologies" />
      </div>
      <div
        v-if=" activeTab === 1"
        class="tab"
      >
        <div class="text">
          Интеграция системы на производство происходила по мере её разработки, так как она решала критически задачи производства.
          <br>
          Перенос базы продуктов на платформу требовал большого количества времени менеджеров,
          чтобы облегчить работу упор в визуальном решении был на юзабилити — акцент на контент и действия с ним, никаких дополнительных отвлекающих графических элементов.

          <h2>Заказы</h2>
          Центральным компонентом системы является заказ, как основная единица бизнеса.
          Для главы отдела продаж важно видеть количество совершенных заказов, этапы производства, объем выручки.
        </div>
        <img src="../assets/projects/kvetun/0.png" alt="Nicolay Apraksin / Kvetun /  Orders table">

        <div class="text">
          Сам заказ — довольно комплексная единица.
          <br>
          Бизнесс работает по всему миру, поэтому рассчет идет в разных валютах.
          Заказ наполняется продуктами, продукты кастомизируются из модулей, к ним крепятся описания и требования к характеристикам.
          <br>
          Исходя из объема и сложности заказа определяются производственные рамки и условия доставки.
          По каждому заказу генерируются инвойсы в соответствии с необходимостями почтывых служб.
          <br>
          Для избежания производственных ошибок все изменения заказов логгируются с возможностью просмотра изменений и возврата к прежним версиям.
        </div>
        <img src="../assets/projects/kvetun/1.png" alt="Nicolay Apraksin / Kvetun / Order detail">

        <div class="text">
          Для удобства работы с почтовыми службами сделана система распределения продукции заказа по коробкам для отправки.
          <br>
          Администратор может указать в каком количестве коробок какого веса будет отправляться заказ.
          Каждая коробка снабжается персональной документацией для прохождения таможен.
        </div>
        <img src="../assets/projects/kvetun/2.png" alt="Nicolay Apraksin / Kvetun / Boxes system">

        <div class="text">
          Система снабжена платежным сервисом.
          Менеджер сформировав заказ может выслать клиенту ссылку на оплату.
        </div>
        <img src="../assets/projects/kvetun/3.png" alt="Nicolay Apraksin / Kvetun / Payment page">

        <div class="text">
          <h2>Продукты</h2>
          Кветунь занимается изготовлением и реализацией широкого спектра фехтовального инвентаря:
          фехтовальные снаряды, защитное снаряжение, экипировка.
          <br>
          Каждое изделие поддается кастомизации по требованию заказчика: разрамер, материал, цвет.
          Для решения задачи была сделана <b>система по кастомизации продукции</b>.
          <br>
          Каждый кастомизируемый элемент заносится в базу с указанием возможных вариаций:
        </div>
        <img src="../assets/projects/kvetun/4.png" alt="Nicolay Apraksin / Kvetun / Product module creation">
        <div class="text">
          У каждого продукта выбирается <b>список изменяемых модулей</b>. На изображении ниже указаны модули для сабли.
        </div>
        <img src="../assets/projects/kvetun/5.png" alt="Nicolay Apraksin / Kvetun / Product modules set">
        <div class="text">
          Менеджер при формировании заказа может указывает требования клиента к кастомизации изделий.
        </div>
        <img src="../assets/projects/kvetun/6.png" alt="Nicolay Apraksin / Kvetun / Product in order customisation">

        <div class="text">
          <h2>Сводная таблица для производства</h2>
          Данный интерфейс показывает производственный план на месяц.
          Здесь собраны и организованы по типам все изделения которые необходимо изготовить, подсчитан расходы материалов.
          По этим данным формируется PDF документ с расстановкой задач производственным отделам.
        </div>
        <img src="../assets/projects/kvetun/8.png" alt="Nicolay Apraksin / Kvetun / Summary">

        <div class="text">
          <h2>Система задач</h2>
          Взаимодействие внутри системы между сотрудниками происходит через систему задач.
          Она соответсвует по функционалу общепритяным таск трекерам, но заточена под контректную область деятельности.
          <br>
          Как пример — задача может касаться заказа, нескольких заказов или же конкретных продуктов в заказе.
          Из интерефейса заказа менеджер может пометить проблемные продукты, задачи будут выставлены соотвествующему производственному отделу.
        </div>
        <img src="../assets/projects/kvetun/9.png" alt="Nicolay Apraksin / Kvetun / Task labels">
        <img src="../assets/projects/kvetun/10.png" alt="Nicolay Apraksin / Kvetun / Task detail">
      </div>
    </div>
  </div>
</template>

<style></style>
