<script setup>
import { ref } from 'vue'
import Technologies from '../components/Technologies.vue'

const technologies = ref({
  roles: ['product design', 'frontend', 'lead'],
  design: ['figma'],
  frontend: ['vue3', 'webpack', 'postcss', 'nuxt', 'ssr'],
  infrastructure: ['git', 'docker', 'gitlab']
})

let activeTab = ref(0)

function setTab (value) {
  activeTab.value = value
}
</script>

<template>
  <div class="page-container">
    <h1>LondonSMP</h1>
    <div class="project-link">
      <a
        href="https://my.londonsmp.co.uk"
        target="_blank"
      >
        my.londonsmp.co.uk→
      </a>
    </div>

    <div class="tabs-menu">
      <button
        :class="{ active: activeTab === 0 }"
        @click="setTab(0)"
      >
        Overview
      </button>
      <button
        :class="{ active: activeTab === 1 }"
        @click="setTab(1)"
      >
        Brief preview
      </button>
      <button
        :class="{ active: activeTab === 2 }"
        @click="setTab(2)"
      >
        Full story
      </button>
      <button
        :class="{ active: activeTab === 3 }"
        @click="setTab(3)"
      >
        Tech stuff
      </button>
    </div>
    <div class="tabs">
      <div
        v-if="activeTab === 0"
        class="tab"
      >
        <div class="text accent">
          London School of Mathematics and Programming — Лондонская школа, занимающаяся дополнительным образованием для
          детей -
          вечерними курсами, курсами выходных дней, многодневными кампами.
          <br>
          За 4 года мы с командой создали полностью <b>кастомную CRM + LMS систему</b>.
          <br>
          Созданная нами система позволила перевести управление всеми процессами в удобную форму, а также запустить онлайн образование.
          <br>
          Моя роль на проекте — <b>фуллстак фронтенд и тимлид</b>. В нашей команде 2 фронтеда, 2 бекенда и 1
          тестировщик.
          Все проектирование и внутренняя коммпуникация — моя зона ответственности.
        </div>

        <Technologies :technologies="technologies"/>
      </div>

      <div
        v-if="activeTab === 1"
        class="tab"
      >
        <img src="../assets/projects/lsmp/1.png" alt="Nicolay Apraksin / LondonSMP / Intro">
        <div class="text">
          Основная специализация школы — <b>дополнительное образование</b>. Вечерние занятия, занятия выходного дня,
          многодневные кампы на каникулах. Система оптимальным образом закрывает нужды всех участинков образовательного процесса.
          <br>
          <b>Ученикам</b> система предоставляет собранную под запросы и нужды ребенка учебную программу.
          Обучение проходит в интересной форме при постоянном спорождении учителем.
          <br>
          <b>Родители учеников</b> следят за прогрессом детей и получают информации об успеваемости и пройденном материале.
          <br>
          <b>Учителя</b> ведут занятия, в реальном времени формируя необходимый ученику конент, проверяют работы учеников,
          отмечают посещаемость и оставляют комментарии об успеваемость для родителей и администрации.
          <br>
          <b>Методисты</b> создают учебные программы на основе которых формируются курсы и уроки. Такая база облегчает их
          работу за счет реиспользования контента.
          <br>
          <b>Администрация</b> формирует сетки расписаний по школам, следит за активностью детей и преподавателей,
          оценивает финансовое состояние школы, проводить рекламные компании и рассылки.
        </div>
      </div>

      <div
        v-if="activeTab === 2"
        class="tab"
      >
        <div class="text">
          Меня позвали в начинающийся проект фуллстак разработчиком.
          Задача заказчика была быстро <b>создать LMS систему</b> с определенными требованиями.
          С нуля создать такой продукт в сжатые сроки конечно же невозможно.
          <br>
          Поэтому было принято решение взять <b>опенсорс LMS Moodle</b> и доплнить её кастомными
          модулями для решения задач заказчика — расширенным функционалом регистрации, учета потребностей учеников, разными типами курсов и учебных программ.
          <br>
          После создания технического костяка следующим этапом было <b>проектирование и реализация собственного интерфейса</b>.
          По ходу его интеграции стало понятно, что не все наши потребности могут быть удоблетворены модулями Moodle.
          <br>
          По этой причине я начал писать <b>свой бекенд на PHP</b> который расширял функции мудла.
          С его развитие стало ясно, что собственные структуры данных и логика работы с ними куда больше подходят проету, нежели алгоритмы Moodle.
          Постепенно вся логика перешла с мудла на свой бек, который лишь иногда обращался к сервисам мудл.
          Но этот бекенд, хоть и <b>реализовывал MVC подход</b>, не использовал современных фреймворком что отягощало дальнейшую разработку.
          <br>
          Проект начал расти и был нанят бекенд разработчик, котоырй взял на себя написание нового полноценного бекенда на Symphony,
          что в скором времни позволило отрезать Moodle.
          <br>
          Так как Moodle является статичным синхронным сайтом, то фронтенд изначально представлял из себя набор страниц,
          каждая из которых была независимым инстансом vue.
          Переход на собственный бекенд позволил объединить все эти страницы в <b>единый асинхронный фронтенд</b> с подгрузкой данных по необходимости.
          <br>
          Где то с этого момента началась современная история нашей системы, которую мы с командой зовем Concent LMS.

          <h2>Concent LMS</h2>
          Урок является основным компонентом системы для ученика.
          <br>
          Автор курса составляет содержимое уроков из упражений. Упражнение — не просто текст, информация подается в удобной для тематики упражнения форме.
          Он может содержать <b>интерактивные графические редакторы, квизы</b> проверяющие знания учеников, домашние задания и многое другое.
        </div>
        <img src="../assets/projects/lsmp/2_2.png" alt="Nicolay Apraksin / LondonSMP / Lesson">
        <div class="text">
          Но не все ученики проходят материал уроков равномерно.
          У учителя есть <b>фукционал кастомизации урока</b> для каждого из учеников — можно скрывать упражнения, хинты и
          солюшены.
          <br>
          Необходимо вывести подсказку ученику? Один клик и содержимое урока у ученика обновится.
        </div>
        <img src="../assets/projects/lsmp/3_7.png" alt="Nicolay Apraksin / LondonSMP / Lesson configuration for students">
        <div class="text">
          <h2>Интерактивные задания</h2>
          Одним из интересных функционалов системя являются интерактивные задания — <b>векторный редактор на основе Canvas</b>.
        </div>
        <img src="../assets/projects/lsmp/2_4.png" alt="Nicolay Apraksin / LondonSMP / Interactive task">
        <div class="text">
          Учитель с учеником поочередно могут вносить изменения, которые сохраняются в истории.
          Всегда можно посмотреть прошлые состояния.
        </div>
        <img src="../assets/projects/lsmp/2_3.png" alt="Nicolay Apraksin / LondonSMP / Interactive task history">
        <div class="text">
          <h2>Quizzes</h2>
          Второй интересный интерактивный элемент — квизы — опросники, закрепляющие знания ученика.
          <br>
          Вопросов могут быть:
          <ul>
            <li>Выбор из вариантов ответов</li>
            <li>Открытый вопрос с кратким текстом</li>
            <li>Вопрос с перетаскиванием элементов в слоты</li>
            <li>Вопрос с открытм богатым текстом и загрузкой файлов</li>
            <li>Вопрос с интерактивным заданием</li>
          </ul>
        </div>
        <img src="../assets/projects/lsmp/2_6.png" alt="Nicolay Apraksin / LondonSMP / Quiz">
        <div class="text">
          Большинство вопросов проверяются автоматически.
          В них могут быть несколько верных вариантов — составитель квиза самостоятельно выставляет какое количество баллов получит ученик.
        </div>
        <img src="../assets/projects/lsmp/2_7.png" alt="Nicolay Apraksin / LondonSMP / Quiz results">

        <div class="text">
          <h2>Lesson administration</h2>
          Во время урока учитель может видеть прогресс каждого ученика.
          Для составления общей картины требуется <b>сводный интерфейс</b>.
          <br>
          Овервью урока позволяет увидеть активность всех учеников разом, прогресс по домашним заданиям и квизам, выставить оценки.
        </div>
        <img src="../assets/projects/lsmp/3_8.png" alt="Nicolay Apraksin / LondonSMP / Lesson overview">
        <div class="text">
          Вторым важным интерфейсом обзора курса является <b>Attendance</b>.
          <br>
          Учитель проставляет посещение занятий,
          помечает активноть учеников на уроке, оставляет комментарии — для родителей и для администрации.
        </div>
        <img src="../assets/projects/lsmp/3_1.png" alt="Nicolay Apraksin / LondonSMP / Lesson Attendance">
        <div class="text">
          У администраторов есть свой интерфейс просмотра учеников курса.
          Для них самым важным является статус записи, диапазон дат и оплата.
        </div>
        <img src="../assets/projects/lsmp/3_2.png" alt="Nicolay Apraksin / LondonSMP / Course users">
        <div class="text">
          На курс можно записаться разными способами:
          <ul>
            <li>Триальное занятие — запись на пробный урок.</li>
            <li>Сабститут — замещение урока другого курса.</li>
            <li>Полная запись — администратор выбирает диапозон дат.</li>
          </ul>
          Ученику доступен материал только тех уроков, на которые выпадает его запись.
        </div>
        <img src="../assets/projects/lsmp/3_4.png" alt="Nicolay Apraksin / LondonSMP / Enrollment">
        <div class="text">
          <h2>Упражнения</h2>
          Каждое упражнение имеет свою тематику и уровень сложности, файлы и комментарии, квизы и интерактивные редакторы, хинты и солюшены.
        </div>
        <img src="../assets/projects/lsmp/3_6.png" alt="Nicolay Apraksin / LondonSMP / Exercise">
        <div class="text">
          Из упражнений методосты сотавляют <b>учебные программы</b>.
          <br>
          Каждая учебная программа объединяет в себе все материалы на определенную тематику.
          Они огранизоваы по главам, освящающим этапы освоения дисциплины.
          Каждая глава наполняется подходящими упражнениями, из которых собираются сеты — блоки упражнений на основе которых удобно создавать уроки.
        </div>
        <img src="../assets/projects/lsmp/3_9.png" alt="Nicolay Apraksin / LondonSMP / Library">

        <div class="text">
          <h2>Chats & Notifications</h2>
          Для общения внутри системы реализована система чатов.
          Технически она выполнена при помощи <b>сокетов</b>, что позволяет обмениваться сообщениями в реальном времени.
          <br>
          Чаты могут существовать независимо или привязыватсья к курсам.
        </div>
        <img src="../assets/projects/lsmp/4_2.png" alt="Nicolay Apraksin / LondonSMP / Chat">
        <div class="text">
          Сообщения о всех важных событиях приходят в виде <b>нотификаций</b> — запись на курс, новый урок, проверен квиз,
          ноавя оценку за домашнее задание и тд.
          <br>
          Также уведомления крайне важны для администрации — они полуают уведомления обо всей активности пользователей в системе.

          <h2>Room allocation & Summary</h2>
          Раскладку расписания администраторы формируют через <b>Room Allocation</b>.
          Распределить уроки по комнатам и времени можно перетаскиванием.
          <br>
          Нажав на имя переподавателя можно узнать о его загруженности.
          <br>
          Всем выбранным препоадавателям возможно разослать уведомления об изменениях в расписании.
        </div>
        <img src="../assets/projects/lsmp/5_2.png" alt="Nicolay Apraksin / LondonSMP / Room Allocation">
        <div class="text">
          Другим сводным интерфейсом помогающим оценить загруженность дня является <b>Summary</b>.
          <br>
          Здесь отображаюатся уроки расставленные по временной очередности.
          В каждом их них выводятся ученики с информацией важной администратору школы —
          типом записи, информацией об оплате, других уроках ученика в этот день, конактная информация родителей.
        </div>
        <img src="../assets/projects/lsmp/5_3.png" alt="Nicolay Apraksin / LondonSMP / Summary">

        <div class="text">
          <h2>Landing constructor</h2>
          Онлайн курсы требуют продвижения.
          Очевидным решением было создавать лендинги, нагнетающие трафик на продающие страницы курса.
          Чтобы не делать лендинги каждый раз вручную, было принято решение разработать <b>конструктор лендингов</b>.
          <br>
          Получившаяся система позволяет создавать многостраничный лендинг.
          Каждая страница наполняется блоками, каждый из которых спроектирован под презентацию информации определенных типов.
          <br>
          Готовые лендинги работают на связке <b>Nuxt + SSR</b>.
          <br>
          Ниже представлен пример страницы собранной при помощи конструктора.
        </div>
        <img src="../assets/projects/lsmp/6_1.png" alt="Nicolay Apraksin / LondonSMP / Landing">
      </div>

      <div
        v-if="activeTab === 3"
        class="tab"
      >
        <div class="text">
          Систему можно представить как связку основного ядра с набором расширяющих модулей.
          <br>
          Часть из них расширяют функционал сущностей, например модуль квизов для упражнений.
          Другие являются независимыми системами, например, Нотификации или Чаты.
        </div>
        <img src="../assets/projects/lsmp/tech_1.svg" alt="Nicolay Apraksin / LondonSMP / Scheme">
        <div class="text">
          На текущий момент система реализует нужды следующего списка ролей:
          <ul>
            <li>Гость — ищет интересуюищее его курсы, регистрируется в системе.</li>
            <li>Родитель — регистрирует детей, покупает детям курсы, следит за образовательным прогрессом.</li>
            <li>Ученик — потребляет статичный и интерактивный образовательный контент.</li>
            <li>Учитель — ведет занятия, управляет контентом доступным ученикам, сопровождает учеников в чатах, ставит
              оценки.
            </li>
            <li>Методист — создает учебный программ — базы образовательного контента.</li>
            <li>Head of learning — создат курсы, наполняет их уроками и упражнениями.</li>
            <li>Администратор — записывает на курсы учеников, взаимодействует с входящими заявками, формирует вейтинг
              листы.
            </li>
            <li>Директор — смотрит общую статистику и аналитику системы.</li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</template>
<style></style>
