<script setup>
import { ref } from 'vue'
import Technologies from '../components/Technologies.vue'

const technologies = ref({
  roles: [ 'concept', 'architects', 'product design', 'frontend', 'lead' ],
  design: [ 'adobe illustrator', 'adobe photoshop' ],
  frontend: [ 'angular2', 'webpack', 'scss' ],
})

let activeTab = ref(0)
function setTab (value) {
  activeTab.value = value
}
</script>

<template>
  <div class="page-container">
    <h1>Zzapp</h1>

    <div class="tabs-menu">
      <button
        :class="{ active: activeTab === 0 }"
        @click="setTab(0)"
      >
        Overview
      </button>
      <button
        :class="{ active: activeTab === 1 }"
        @click="setTab(1)"
      >
        Interfaces
      </button>
    </div>
    <div class="tabs">
      <div
        v-if="activeTab === 0"
        class="tab"
      >
        <div class="text">
          Браузерная квиз игра для обучения игре в Dota 2.
          <br>
          Аудитория киберспорта все растет, Dota 2 является одной из лидирующих дисциплин с миллионами игроков.
          Киберспортсмены участвующие в соревнованиях получают огромные призовые деньги, а чтобы стать киберспортсменом не нужно ничего кроме компьюетра и умения.
          И огромное число рядовых игроков видит эти возмоности и стремится в высшие лиги.
          <br>
          Мы хотели создать игру, которая помогала бы этим игрокам расти, а также давала бы им дополнительный ресурс,
          где они могут проводить время среди так любимого ими антуража. Мы же планировали монетизироваться через внутреигровые покупки и трафик.
          <br>
          Разрабатывали вдвоем с товарищем. На мне был дизайн, фронтенд и управление проектом. На товарище бекенд.
          <br>
          Проект мы разработали и довели до логической точки, запустились, получили позитивные отзывы игроков.
          Но дальше натолкнулись на то, что наша система требует постоянного обновления контента, на что требуется больше финансирование, которого у нас не было.
        </div>

        <Technologies :technologies="technologies" />
      </div>
      <div
        v-if="activeTab === 1"
        class="tab"
      >
        <div class="text">
          Основная идея такая - игроки в Dota2 зачастую настолько увлечены своим хобби, что все свободное время тратят на игру.
          В основном, конечно, они непосредственно играют. Но кроме игры они остальное время тратят на сопутствующей игре контент - просмотр стримов большим игроков, просмотр турниров.
          <br>
          Но просмотр стримов - пассивное дело. И здесь мы хотели развернуться. Зачем просто смотреть стрим, если можно смотреть стрим и тут же играть?
          Главный экран игры предлагал выбрать интересующий тебя стрим.
        </div>
        <img src="../assets/projects/zzapp/1.png" alt="Nicolay Apraksin / Zzapp / Index">
        <div class="text">
          Но стрим открывался на часть экрана, а рядом с ним уже можно запускать игру.
        </div>
        <img src="../assets/projects/zzapp/1a.png" alt="Nicolay Apraksin / Zzapp / Stream">
        <div class="text">
          Вторым сценарием использования игры - занять время, когда компьютер недоступен. Система полносностью адаптирована под мобильные платформы, которые всегда под рукой.
          В транспорте, пока ждешь товарища, в перерывах между учебой.
        </div>
        <img src="../assets/projects/zzapp/mobile2.png" alt="Nicolay Apraksin / Zzapp / Mobile game">

        <div class="text">
          <h2>О самой игре</h2>
          Игра построена по модели самой Dota2, для близости самим игрокам.
          Каждый сценарий представляет из себя несколько этапов, прохождение каждого из которых дает пройти на определенное количество следующих.
        </div>
        <img src="../assets/projects/zzapp/2.png" alt="Nicolay Apraksin / Zzapp / Scenario">

        <div class="text">
          Каждый этап внутри себя выглядит как череда вопросов.
          Каждый вопрос поставлен в соответсвие с существом. Каждое существо поставляет вопросы определенного типа.
          Один - выбор из двух вариантов, другой то из трех, третий - с возможностью выбрать неколько их четырех ответов и тд.
          Вопросы на время, не успел - считай неверно ответил!
          <br>
          Игра идет до тех пор, пока у игрока не закончились единцы здоровья.
          Каждый неверно отвеченный вопрос снимает одну единицу здоровья.
          <br>
          За каждый верно отвеченынй вопрос игрок получает внутреннюю валюту.
          За неё в игровой лавке можно купить предметы, дающие дополнительные возможности - больше здоровья на старте, восстановление здоровья по ходу игры, пропуск вопроса.
        </div>
        <img src="../assets/projects/zzapp/3.png" alt="Nicolay Apraksin / Zzapp / Game">

        <div class="text">
          Закончилось время? Потерял здоровье.
        </div>
        <img src="../assets/projects/zzapp/4.png" alt="Nicolay Apraksin / Zzapp / Timeout">

        <div class="text">
          Неверно ответил? Упс.
        </div>
        <img src="../assets/projects/zzapp/5.png" alt="Nicolay Apraksin / Zzapp / Wrong answer">

        <div class="text">
          Правильный ответ! Иди дальше, а также получи немного вознаграждения - за тип вопроса, а также за оставшееся время.
        </div>
        <img src="../assets/projects/zzapp/6.png" alt="Nicolay Apraksin / Zzapp / Write answer">

        <div class="text">
          Внутриигровой магазин с предметами. Накапливай игровую валюту, трать на улучшения!
        </div>
        <img src="../assets/projects/zzapp/7.png" alt="Nicolay Apraksin / Zzapp / Shop">

        <div class="text">
          <h2>Управление</h2>
          Для управления такой игрой требуются богатые интерфейсы для управления данным.
          Создание категорий вопросов, сценариев, вопросов, просмотр статистики и тд.
          <br>
          Вопросы в игре касаются контента из самой Dota2, поэтому в них мы выводим названия, иконки, какие то цифры.
          Чтобы не подгружать это каждый раз заново мы сделали у себя базу этих значений - героев, существ, их способностей, предметов.
          А при создании вопроса достаточно поставить $ и воспользоваться поисковым контекстым меню для подставки подходящией сущности.
        </div>
        <img src="../assets/projects/zzapp/9.png" alt="Nicolay Apraksin / Zzapp / Question creation">
        <div class="text">
          И конечно же мы следим за игроками! Каждая ваша игра записана - все ответы, потраченное время, стратегия поведения.
          На основе этих данных мы хотели сочинить интерфейс показывающий познания игроков в тематиках Dota2.
        </div>
        <img src="../assets/projects/zzapp/8.png" alt="Nicolay Apraksin / Zzapp / Game history">
      </div>
    </div>
  </div>
</template>

<style></style>
